{
  "gamePosts": [
    {
      "id": "79f6",
      "gameTitle": "No Man's Sky",
      "gameDescription": "No Man's Sky is an action-adventure survival game developed and published by Hello Games. It was released worldwide for the PlayStation 4 and Windows in August 2016, for Xbox One in July 2018, for the PlayStation 5 and Xbox Series X and Series S consoles in November 2020, for Nintendo Switch in October 2022, and for macOS in June 2023. The game is built around four pillars: exploration, survival, combat, and trading.",
      "likes": 0
    },
    {
      "id": "dead",
      "gameTitle": "Ark: Survival Ascended",
      "gameDescription": "ARK: Survival Ascended was announced in March 2023 to be released in August 2023, however this release window was then delayed until October 2023. Survival Evolved's official servers were set to be shut down at the same time, with the shutdown date being delayed until September 30, 2023 when Survival Ascended's release window was pushed back. Unlike previously stated by the studio co-founder, the remaster would not be a free upgrade. Survival Ascended was eventually released in early access for Windows on October 25, 2023, Xbox Series X/S on November 21, 2023, and PlayStation 5 on November 30, 2023",
      "likes": 2
    },
    {
      "id": "cbcb",
      "gameTitle": "Enlisted",
      "gameDescription": "Enlisted is a free squad-based multiplayer tactical first-person shooter developed by Darkflow Software and published by Gaijin Entertainment. The game is set during World War II and revolves around major battles fought across all fronts of the war. It was an Xbox Series X/S launch title and timed console exclusive. On March 2, 2021, the closed beta went live on PlayStation 5. On April 8, 2021, the game was released on PC as an open beta test.",
      "likes": 4
    },
    {
      "id": "fc31",
      "gameTitle": "Assassin's Creed Mirage",
      "gameDescription": "Assassin's Creed Mirage is a 2023 action-adventure game developed by Ubisoft Bordeaux and published by Ubisoft. The game is the thirteenth major installment in the Assassin's Creed series and the successor to 2020's Assassin's Creed Valhalla. While its historical timeframe precedes that of Valhalla, its modern-day framing story succeeds Valhalla's own. Set in 9th-century Baghdad during the Islamic Golden Age—in particular during the Anarchy at Samarra—the story follows Basim Ibn Ishaq (a character first introduced in Valhalla), a street thief who joins the Hidden Ones to fight for peace and liberty, against the Order of the Ancients,[b] who desire peace through control. The main narrative focuses on Basim's internal struggle between his duties as a Hidden One and his desire to uncover his mysterious past.",
      "likes": 2
    }
  ],
  "registeredUsers": [
    {
      "id": "39e3",
      "firstname": "Martin",
      "lastname": "Aleksandrov",
      "email": "martin@gmail.com",
      "password": "administrator"
    },
    {
      "id": "69a6",
      "firstname": "Aleksandar",
      "lastname": "Martinov",
      "email": "aleksandar@gmail.com",
      "password": "administrator"
    },
    {
      "id": "248d",
      "firstname": "Petar",
      "lastname": "Petrov",
      "email": "petar@gmail.com",
      "password": "administrator"
    },
    {
      "id": "c751",
      "firstName": "Martin",
      "lastName": "MartinMartin",
      "email": "martinmartin@gmail.com",
      "password": "1234567"
    },
    {
      "id": "5235",
      "firstName": "Venci",
      "lastName": "Vencov",
      "email": "venci@gmail.com",
      "password": "12345678"
    }
  ]
}